Repository: marcos-cezar/basicchess
Catalog: lib/l10n/app_*.arb
Languages: pt

# apptitle
source: Basic Chess
pt: Xadrez Básico

# start_rules
source: Basic rules
pt: Regras básicas

# start_rules_description
source: Learn the basic rules of the game
pt: Aprenda o básico sobre o jogo

# openings_title
source: Openings
pt: Aberturas

# openings_description
source: Memorize the most famous openings
pt: Memorize as aberturas mais famosas

# studies_title
source: Studies
pt: Estudos

# studies_description
source: Study one of your matches or one famous match of a grand master
pt: Estude uma de suas partidas ou uma partida famosa de um grande mestre

# start_position_title
source: Start position
pt: Posição inicial

# start_position_description
source: At the begining of the game the pieces must be like the position below. The 16 pieces occupy the first horizontal rows on each side on each side. The pawns occupy the second horizontal, the rooks in the corners, the knights next to the rooks and the bishops next to the knights. The white queen occupies the white square, the black queen the black square. Kings are placed next to their queens.
pt: Ao se iniciar uma partida as peças devem ocupar a posição abaixo. As 16 peças ocupam de cada lado as primeiras linhas horizontais de cada lado. Os peões ocupam a segunda horizontal, as torres nos cantos, os cavalos junto às torres e os Bispos juntos aos cavalos. A dama branca ocupa a casa branca, a dama preta a casa preta. Os reis situam-se ao lado das respectivas damas.

# board_title
source: Board
pt: Tabuleiro

# board_description
source: The battlefield is divided into a square divided into 64 houses, painted alternately between dark and light. Just like the diagram below.
pt: O campo de batalha se divide em um quadrado dividido em 64 casas, pintadas alternadamente entre escuras e claras. Assim como o diagrama abaixo.

# board_tip
source: The correct position on the board is where the players have the last white square to their right.
pt: A posição correta do tabuleiro é aquela onde os jogadores tenham a sua direita o último quadrado branco.

# click_to_know_more_label
source: Click to show more
pt: Clique para saber mais

source: Initial rules
pt: Regras iniciais

# board_menu_description
source: Know the scenario where the match takes place.
pt: Conheça o cenário onde a partida acontece.

# start_menu_position_description
source: Learn the initial arrangement of the pieces.
pt: Aprenda qual a disposição inicial das peças.

# bishop_label
source: Bishop
pt: Bispo

# rook_label
source: Rook
pt: Torre

# rook_move_short_description
source: Tower moves horizontally or vertically.
pt: Torre move-se horizontalmente ou verticalmente.

# queen_label
source: Queen
pt: Dama

# queen_move_short_description
source: The queen moves like the rook and bishop.
pt: A dama move-se como a torre e o bispo.

# king_label
source: King
pt: Rei

# king_move_short_description
source: The king moves like the queen only one square.
pt: O rei move-se como a dama só que apenas uma casa.

# pawn_label
source: Pawn
pt: Peão

# pawn_move_short_description
source: Pawn moves forward or two squares forward from its starting position.
pt: Peão move-se para frente ou duas casas para frente da sua posição inicial.

# knight_label
source: Knight
pt: Cavalo

# knight_move_short_description
source: Horse moves in an "L" shape.
pt: Cavalo move-se em formato de "L".

# bishop_move_big_description
source: It moves diagonally, not being able to jump intervening pieces, and captures taking the place occupied by the opposing piece. Due to the characteristics of its movement, it has a color weakness deficiency where its movement is limited to the color of the square from which it starts the game.
pt: Movimenta-se em diagonal, não podendo pular peças intervenientes, e captura tomando o lugar ocupado pela peça adversária. Devido às características de seu movimento tem a deficiência da fraqueza da cor onde seu movimento fica limitado à cor da casa de onde inicia a partida.

# rook_move_big_description
source: Moves horizontally and vertically across the board. It is usually employed in the midgame and late game due to its strategic and tactical value. Its relative value is high, and may vary more depending on its positioning in open columns or ranks, or strategic formations.
pt: Movimenta-se na horizontal e vertical por todo o tabuleiro. É Empregada usualmente no meio-jogo e fase final devido ao seu valor estratégico e tático. Seu valor relativo é alto, podendo variar para mais em função de seu posicionamento em colunas ou fileiras abertas, ou formações estratégicas.

# queen_move_big_description
source: It is the highest relative value piece in the game. Like the Rook, it is able, with the help of its King, to win a game against a lone King. Due to its high mobility, it is the favorite piece of beginner chess player.
pt: É a peça de maior valor relativo do jogo. Assim como a Torre, é capaz de, com o auxílio do seu Rei, vencer uma partida contra um Rei solitário. Por sua alta mobilidade é a peça preferida do enxadrista iniciante.

# knight_move_big_description
source: It has a movement similar to an "L" and, unlike the other pieces, it can skip the intervening pieces. Capture taking the square occupied by the opponent's piece, always at the end of the L. The piece is more active in the extended center where it can attack more squares than in the corner and is the only one that cannot lose time and therefore cannot avoid zugzwang positions.
pt: Tem um movimento assemelhado a um "L" e, diferente das outras peças, pode pular as peças intervenientes. Captura tomando a casa ocupada pela peça adversário, sendo sempre no final do L. A peça é mais ativa no centro ampliado onde pode atacar mais casas do que no canto e é a única que não consegue perder um tempo e em função disso não consegue evitar posições de zugzwang.

# king_move_big_description
source: The King is the most important piece of chess, whose capture is the only objective of the game. Since it cannot be exchanged during a match, it is considered a priceless piece. During a game, the King cannot remain under threat from the opposing pieces at any time, and must be put to safety immediately on the next move, if attacked. The rules of etiquette in chess indicate that by threatening the opponent's King, the attacker can break the silence of the game and announce "Check!" and, in case the King cannot escape capture, announce "Checkmate! ". These gestures are considered optional under the game rules. Its movement consists of moving a square in a horizontal, vertical or diagonal direction, as long as it is not under enemy attack. If it has not yet been moved in the game, the King is allowed to perform a special move called castling with one of the rooks, with which it can be protected by moving it two squares horizontally, if these squares are not under attack and the King is not be in check.
pt: O Rei é a peça mais importante do xadrez, cuja captura é o único objetivo do jogo. Uma vez que não pode ser trocado durante uma partida, ele é considerado uma peça de valor inestimável. Durante uma partida, o Rei não pode permanecer sob ameaça das peças adversárias em nenhum instante, devendo ser colocado em segurança imediatamente no movimento seguinte, caso seja atacado. As regras de etiqueta no xadrez indicam que ao ameaçar o Rei do adversário, o atacante pode quebrar o silêncio da partida e anunciar "Xeque!" e, no caso do Rei não poder escapar da captura, anunciar "Xeque-mate!". Esses gestos são considerados opcionais segundo as regras do jogo. A sua movimentação consiste no deslocamento de uma casa na direção horizontal, vertical ou diagonal, desde que ela não esteja sob ataque adversário. Caso ainda não tenha sido movimentado no jogo, é permitido ao Rei realizar um movimento especial denominado roque com uma das torres, com o que se pode protegê-lo deslocando-o duas casas horizontalmente, caso estas casas não estejam sob ataque e o Rei não esteja em xeque.

# pawn_move_big_description
source: The pawn moves vertically on the column it is in, being unable to retreat. In the first move, from the starting point, you can advance two spaces and, from there, one. A pawn can capture the piece immediately on the diagonal row. When on the fifth rank, it can capture en passant the opponent's pawn on the adjacent file that advances two squares on its first move. Upon reaching the eighth row, it becomes any other piece, excluding the king, a move called coronation or promotion; the pawn will be immediately replaced by another piece than the knight, bishop, rook or queen and must be removed from the board. It is worth noting that when being transformed it cannot be removed in a first move.
pt: O peão move-se verticalmente na coluna que encontra-se, sendo incapaz de recuar. No primeiro movimento, a partir do ponto de partida, pode avançar duas casas e, a partir daí, uma. Um peão pode capturar a peça imediatamente na fileira na diagonal. Quando na quinta fileira, pode capturar en passant o peão adversário na coluna adjacente que avançar duas casas em seu primeiro movimento. Ao atingir a oitava linha transforma-se em qualquer outra peça, excluindo o rei, movimento chamado de coroação ou promoção; o peão será substituído imediatamente por outra peça que pelo cavalo, bispo, torre ou rainha e deverá ser removido do tabuleiro. Vale se atentar que ao ser transformado ele não pode ser removido em um primeiro movimento.

# ruy_lopez_opening_description
source: The Ruy Lopez, also known as the Spanish Opening, quickly develops the kingside pieces and puts pressure on the center. 3... a6 This is the most popular move, but many other moves have been here played.
pt: A Ruy Lopez, também conhecida como a Abertura Espanhola, desenvolve rapidamente as peças da ala de rei e coloca pressão sobre o centro. 3... a6. Este é o lance mais popular, mas muitos outros lances tem sido aqui jogados.

# sicilian_opening_description
source: The Sicilian Defense is Black's most popular response to the "1.e4" move, especially among the strongest chess players. It allows Black to fight for the center, directly attacking the "d4" square, while avoiding the symmetrical positions that arise from "1...e5". Because it is so popular, the Sicilian defense also has many, all of which are quite diverse. The main line starts with the answer 2...d6: 1.e4 c5 2.Nf3 d6 3.d4 cxd4 4.Nxd4 Nf6 5.Nc3, where Black's answer defines as main variants: 5...a6 : Najdorf variant 5...Nc6 : Classic Variant 5...e6 : Scheveningen variant 5...g6 : Dragon Variant In addition to these, the Smith-Morra Gambit, the Alapin Variant, the Sveshnikov Variant, the Accelerated Dragon and the Scheveningen Variant are also common.
pt: A Defesa Siciliana é a resposta mais popular das pretas ao lance "1.e4", principalmente entre os enxadristas mais fortes. Ela permite às pretas a luta pelo centro, atacando diretamente a casa "d4", ao mesmo tempo que evita as posições simétricas que surgem a partir de "1...e5". Por ser tão popular, a defesa siciliana também tem muitas, todas elas são bastante diversificadas. A linha principal começa com a resposta 2...d6: 1.e4 c5 2.Nf3 d6 3.d4 cxd4 4.Nxd4 Nf6 5.Nc3, onde a resposta das pretas define como principais variantes: 5...a6 : Variante Najdorf 5...Nc6 : Variante Clássica 5...e6 : Variante Scheveningen 5...g6 : Variante Dragão Além destas, também são comuns o Gambito Smith-Morra, o Variante Alapin, o Variante Sveshnikov, o Dragão Acelerado e o Variante Scheveningen.
